---
lab:
    title: '练习 1 - 配置 Microsoft Sentinel 环境'
    module: '模块 5 - 配置 Microsoft Sentinel 环境'
---

# 模块 5 - 实验室 1 - 练习 1 - 配置 Microsoft Sentinel 环境

## 实验室场景

你是一位安全运营分析师，你所在公司正在实现 Microsoft Sentinel。你负责设置满足公司要求的 Microsoft Sentinel 环境，并最大程度降低成本、符合法规要求，同时为安全团队提供最易于管理的环境，以便其履行日常工作职责。


### 任务 1：初始化 Microsoft Sentinel 工作区。

在此任务中，你将创建 Microsoft Sentinel 工作区。

1. 使用以下密码以管理员身份登录到 WIN1 虚拟机：**Pa55w.rd**。  

2. 打开 Microsoft Edge 浏览器。

3. 在 Microsoft Edge 浏览器中，通过 https://portal.azure.com 导航到 Azure 门户。

4. 在 **“登录”** 对话框中，复制粘贴实验室托管提供者提供的**租户电子邮件**帐户，然后选择 **“下一步”**。

5. 在 **“输入密码”** 对话框中，复制粘贴实验室托管提供者提供的**租户密码**，然后选择 **“登录”**。

6. 在 Azure 门户的搜索栏中，键入 *Sentinel*，然后选择“**Microsoft Sentinel**”。

7. 选择 **“+ 创建”**。

8. 接下来，选择 **“新建工作区”**。

    >**备注**：首先，创建新的 Log Analytics 工作区。

9. 选择合适的订阅。

10. 选择资源组的“**新建**”链接，输入所选的新资源组名称，然后选择“**确定**”。

11. 在“名称”字段中的 *“实例详细信息”* 下，输入为 Log Analytics 工作区选择的名称。

    >**备注**：此名称也将是 Microsoft Sentinel 工作区的名称。

12. 选择适合你的区域。适当的区域可采用默认区域，或者讲师可能会对选择哪个区域提供具体建议。  

13. 选择 **“查看 + 创建”**。

14. 在“创建 Log Analytics 工作区”区域，选择“**创建**”。等待“*将 Microsoft Sentinel 添加到工作区*”页面上的列表中显示新的 Log Analytics 工作区。  这可能需要一分钟时间。

15. 在新创建的工作区显示时将其选中，然后选择“**添加**”。这可能需要几分钟时间。

16. 浏览新建的 Microsoft Sentinel 工作区以熟悉用户界面选项。


### 任务 2：创建 Watchlist。

在此任务中，你将在 Microsoft Sentinel 中创建监视列表。

1. 在 Windows 10 屏幕底部的搜索框中，输入“*记事本*”。  从结果中选择“**记事本**”。

2. 键入“*主机名*”，然后输入新行。

3. 在记事本的第 2 行到第 6 行，复制以下主机名，每个主机名单独列一行：

```Notepad
Host1
Host2
Host3
Host4
Host5
```

4. 从菜单中依次选择“文件”、 **“另存为”**，将文件命名为 *“HighValue.csv”*。  然后将文件类型更改为 **“所有文件”(*.*)**。  然后选择 **“保存”**。  文件可保存在电脑的 *Documents* 文件夹中。

5. 关闭记事本。

6. 在 Microsoft Sentinel 中，在“配置”区域中选择“**Watchlist**”选项。

7. 从命令栏中选择 **“+ 添加新增”**。

8. 在 Watchlist 向导中，输入以下内容：

    |常规设置|值|
    |---|---|
    |名称|**HighValueHosts**|
    |说明|**高价值主机**|
    |Watchlist 别名|**HighValueHosts**|

9. 选择 **“下一步: 源 >”**。

10. 在“**上传文件**”下选择“**浏览文件**”，然后浏览刚刚创建的 *HighValue.csv* 文件。

11. 在“*SearchKey*”字段中，选择“**主机名**”。

12. 选择“下一步: **查看并创建 >”**。

13. 检查输入的设置，然后选择“**创建**”。

14. 屏幕返回到 Watchlist 列表。

15. 选择新 watchlist。  在右侧选项卡上，选择 **“在 Log Analytics 查看”**。

16. 现在，可以在自己的 KQL 语句中使用 _GetWatchlist('HighValueHosts') 来访问列表。要引用的列将是*主机名*。

```KQL
_GetWatchlist('HighValueHosts')
```

>**备注**：导入可能需要几分钟时间才能完成。可继续执行后面的任务，稍后再回来运行此命令。

17. 选择右上角的“x”可关闭“*日志*”窗口，单击“**确定**”可放弃未保存的编辑。


### 任务 3：创建威胁指标。

在此任务中，你将在 Microsoft Sentinel 中创建指标。

1. 在 Microsoft Sentinel 中，在“威胁管理”区域中选择“**威胁智能**”选项。

2. 从命令栏中选择 **“+ 添加新增”**。

3. 在“*类型*”下拉列表中查看可用的不同指标类型。选择“**domain-name**”。在“域”框中输入姓名首字母缩写。例如 *fmg.com*。

4. 对于威胁类型，请选择“**恶意活动**”。

5. 对于*名称*，输入用于域的同一个值。例如 *fmg.com*。

6. 将 *“生效日期”* 字段设置为今天。

7. 选择 **“应用”**。

    >**备注**：指标可能需要几分钟时间才能显示。

8. 在“常规”区域中选择“**日志**”选项。可能需要禁用“始终显示查询”选项，并关闭“*查询*”窗口来运行语句。

9. 运行以下 KQL 语句。

```KQL
ThreatIntelligenceIndicator
```
向右滚动结果以查看“DomainName”列。还可以运行以下 KQL 语句，这样就可以仅查看“DomainName”列。  

```KQL
ThreatIntelligenceIndicator
| project DomainName
```

## 你已完成本实验室。
